Revit 2026 API

# NumberingSchemaAssignElementsToSequence Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AssignElementsToSequence(
	ISet<ElementId> elementIds,
	string partitionName
)
```
```vb
Public Sub AssignElementsToSequence (
	elementIds As ISet(Of ElementId),
	partitionName As String
)
```
```cpp
public:
void AssignElementsToSequence(
	ISet<ElementId^>^ elementIds,
	String^ partitionName
)
```
```fsharp
member AssignElementsToSequence :
        elementIds : ISet<ElementId> *
        partitionName : string -> unit
```

#### Parameters

elementIds ISetElementId

partitionName String

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace